InformationRegisters/РСК_СоответствиеСтатей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>РСК_СоответствиеСтатей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатьяБП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяЕРП</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиДоходов</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСтатьиБП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РСК_ТипыСтатейБП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РСК_ТипыСтатейБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>РСК_ТипыСтатейБП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Затрат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходыИРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РБП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/РСК_СоответствиеСтатей/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура СтатьяЕРППриИзменении(Элемент)
	
	СтатьяЕРППриИзмененииНаСервере()	
	
КонецПроцедуры

&НаСервере
Процедура СтатьяЕРППриИзмененииНаСервере()
	
	Если Не ЗначениеЗаполнено(Запись.ТипСтатьиБП) Тогда
		Если ТипЗнч(Запись.СтатьяЕРП) = Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов") Тогда	
			Запись.ТипСтатьиБП = Перечисления.РСК_ТипыСтатейБП.Затрат
		ИначеЕсли ТипЗнч(Запись.СтатьяЕРП) = Тип("ПланВидовХарактеристикСсылка.СтатьиДоходов") Тогда
			Запись.ТипСтатьиБП = Перечисления.РСК_ТипыСтатейБП.ПрочиеДоходыИРасходы
		ИначеЕсли ТипЗнч(Запись.СтатьяЕРП) = Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств") Тогда 
			Запись.ТипСтатьиБП = Перечисления.РСК_ТипыСтатейБП.ДДС
		КонецЕсли
	КонецЕсли
	
КонецПроцедуры
